msg = "我是%s，我今年%s岁了"%('刘总','25')
print(msg)
msg = '我身高{}，体重{}'.format('180','130')
print(msg)

msg = "我是%(name)s,今年%(age)s岁了"%{'name':'刘总','age':22}
print(msg)


'''========================================位置参数==============================='''
msg = '我是{}，今年{}岁了'.format('刘总 啊啊啊',22)
print(msg)
msg = '我是{}，今年{}岁了'.format(*('刘总',22))
print(msg)


'''========================================关键字参数==============================='''
msg = '我是{name}，今年{age}岁了'.format(age=22,name = 'liuzong')
print(msg)
msg = '我是{name}，今年{age}岁了'.format(**{'name':'刘总','age':22})
print(msg)