'''
数据在内存中是以unicode的形式存储的
要将文件写入内存中就要将数据压缩成utf-8或者gbk的形式
'''
v1 = 'alex'
v2 = v1
v1.upper()
print(v1,v2)  # alex alex

list1 = [1,2,3,4]
a = 1
print(id(a))
print(id(list[0]))  # 2500751681840   2500759881920


'''
深拷贝会将所有可变的变量的地址都进行拷贝，一般情况下看不出来和浅拷贝的区别
只有当有列表嵌套，列表嵌套字典，之类的嵌套关系，才会体现出来差别

小诀窍：深层拷贝只拷贝可变类型的地址，浅拷贝只拷贝最外面一层的地址
'''
import copy
v1 = [1,2,3,4]
v2 = copy.copy(v1)
print(id(v1),id(v2))  # 1900935802240 1900935758016
v3 = copy.deepcopy(v1)
print(id(v1),id(v3))  # 1900935802240 1900935776576

v1 = [1,2,3,[4,5,6]]  # 嵌套的列表
v2 = copy.copy(v1)
print(id(v1[3]),id(v2[3]))  # 2964643961664 2964643961664
v3 = copy.deepcopy(v1)
print(id(v1[3]),id(v3[3]))  # 2964643961664 2964643893440
print(v1[3] == v3[3])  # True
print(v1[3] is v3[3])  # False